Seleccionamos el Dataset "Consumo de Alcohol por parte de los Estudiantes"

In [23]:
import pandas as pd
data = pd.read_csv("student-mat.csv")
data.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

Seleccionamos la columna a trabajar "Edad"

In [24]:
lista = data["age"]
print(lista)

0      18
1      17
2      15
3      15
4      16
5      16
6      16
7      17
8      15
9      15
10     15
11     15
12     15
13     15
14     15
15     16
16     16
17     16
18     17
19     16
20     15
21     15
22     16
23     16
24     15
25     16
26     15
27     15
28     16
29     16
       ..
365    18
366    18
367    17
368    18
369    18
370    19
371    18
372    17
373    17
374    18
375    18
376    20
377    18
378    18
379    17
380    18
381    18
382    17
383    19
384    18
385    18
386    18
387    19
388    18
389    18
390    20
391    17
392    21
393    18
394    19
Name: age, Length: 395, dtype: int64

Hallamos la media

In [25]:
s=0
for i in lista:
    s=s+i
n=len(lista)
media=s/n
print(media)

16.696202531645568

Hallamos la moda

In [27]:
moda=0
cantModa=0
for i in lista:
    elemento=i
    contador=0
    for j in lista:
        if(i==j):
            contador=contador+1
    if(contador > cantModa):
        moda = i
        cantModa=contador
print(moda)
#print(cantModa)

16

Hallamos la desviacion estandar

In [28]:
suma=0
for i in lista:
    suma=suma+(i-media)**2
radicando = suma/(len(lista)-1)
desEst=radicando**(1/2)
print(desEst)

1.2760427246056245

Seleccionamos el Dataset "World University Rankings"

In [65]:
import pandas as pd
data = pd.read_csv("shanghaiData.csv")
data.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

Seleccionamos la columna a trabajar "pub" que son el numero total articulos indexados y citados en publicaciones cientificas

In [66]:
lista = data["pub"]
print(lista)

0       100.0
1        70.9
2        72.3
3        72.2
4        64.3
5        52.5
6        69.5
7        48.5
8        56.4
9        68.4
10       63.9
11       66.3
12       64.5
13       75.6
14       71.8
15       68.7
16       73.8
17       58.8
18       67.7
19       86.5
20       76.5
21       72.3
22       64.6
23       76.7
24       58.0
25       60.5
26       43.4
27       53.9
28       55.4
29       24.0
        ...
3484     20.2
3485     28.1
3486     22.6
3487     23.8
3488     25.5
3489     29.1
3490     28.1
3491     24.0
3492     33.1
3493     32.4
3494     25.3
3495     27.6
3496     26.0
3497     22.5
3498     24.6
3499     19.1
3500     25.5
3501     25.7
3502     27.5
3503     23.0
3504     36.7
3505     32.4
3506     23.4
3507     28.0
3508     26.5
3509     36.6
3510     32.9
3511     39.2
3512     20.0
3513     31.5
Name: pub, Length: 3514, dtype: float64

Hallamos la media

In [68]:
s=0
c=0
for i in lista:
    s=s+i
    #c=c+1
    #print(c)
    #print(s)
n=len(lista)
media=s/n
print(media)

37.21289129197501

Hallamos la moda

In [69]:
moda=0
cantModa=0
for i in lista:
    elemento=i
    contador=0
    for j in lista:
        if(i==j):
            contador=contador+1
    if(contador > cantModa):
        moda = i
        cantModa=contador
print(moda)
print(cantModa)

37.8
19

Hallamos la desviacion estandar

In [70]:
suma=0
for i in lista:
    suma=suma+(i-media)**2
radicando = suma/(len(lista)-1)
desEst=radicando**(1/2)
print(desEst)

12.931067390197764